
## Plan Result




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.s2s-secret-bulkscan-api


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.s2s-secret-bulkscan-api will be created
  + resource "azurerm_key_vault_secret" "s2s-secret-bulkscan-api" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-kv-aat"
      + name           = "s2s-secret-bulkscan-api"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":139,"Program":"tfcmt","SHA1":"","Vars":{}} -->